simulations/openfoam/templates/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: v2312
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
  Wind-tunnel domain for external aerodynamics.

  Coordinate system:
    x – streamwise (wind direction, +x = upstream → downstream)
    y – spanwise (lateral, symmetric)
    z – normal (ground at z=0, sky at z=Lz)

  Domain:
    Upstream:   3L  (L = characteristic length, typically ~3 m for a car)
    Downstream: 8L
    Lateral:  ±3L
    Height:    3L  (above ground)
*/

scale 1;

// Characteristic length [m]
L 3.0;

// Domain extents [m]
xMin  #eval { -3.0 * $L };   // Inlet
xMax  #eval {  8.0 * $L };   // Outlet
yMin  #eval { -3.0 * $L };   // Side (left)
yMax  #eval {  3.0 * $L };   // Side (right)
zMin  0;                       // Ground
zMax  #eval {  3.0 * $L };   // Top

// Background mesh resolution (for snappyHexMesh to refine)
nx 44;
ny 36;
nz 18;

vertices
(
    ($xMin  $yMin  $zMin)   // 0
    ($xMax  $yMin  $zMin)   // 1
    ($xMax  $yMax  $zMin)   // 2
    ($xMin  $yMax  $zMin)   // 3
    ($xMin  $yMin  $zMax)   // 4
    ($xMax  $yMin  $zMax)   // 5
    ($xMax  $yMax  $zMax)   // 6
    ($xMin  $yMax  $zMax)   // 7
);

blocks
(
    // Grading: mild stretching towards inlet/outlet for better boundary layer
    hex (0 1 2 3 4 5 6 7)
    ($nx $ny $nz)
    simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }

    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }

    ground
    {
        type wall;
        faces ( (0 1 2 3) );
    }

    top
    {
        type symmetry;
        faces ( (4 5 6 7) );
    }

    sides
    {
        type symmetry;
        faces
        (
            (0 1 5 4)   // front face (-y)
            (3 7 6 2)   // back face  (+y)
        );
    }
);

// ************************************************************************* //
