simulations/openfoam/templates/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: v2312
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ─────────────────────────────────────────────────────────────────────────────
// Phase switches
// ─────────────────────────────────────────────────────────────────────────────
castellatedMesh true;
snap            true;
addLayers       true;

// ─────────────────────────────────────────────────────────────────────────────
// Geometry
// ─────────────────────────────────────────────────────────────────────────────
geometry
{
    geometry.stl
    {
        type    triSurfaceMesh;
        name    geometry;
    }

    // Refinement box around the object (3 characteristic lengths downstream)
    refinementBox
    {
        type    searchableBox;
        min     (-1.5 -1.5 -0.1);
        max     (4.0   1.5  2.0);
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Castellated mesh controls
// ─────────────────────────────────────────────────────────────────────────────
castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      8000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;

    features
    (
        {
            file    "geometry.eMesh";
            level   3;
        }
    );

    refinementSurfaces
    {
        geometry
        {
            level (3 5);
            patchInfo
            {
                type wall;
                inGroups (wall);
            }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode    inside;
            levels  ((1E15 2));
        }
    }

    // Point inside the fluid domain (not inside the geometry!)
    locationInMesh  (-8.0 0.0 1.5);

    allowFreeStandingZoneFaces true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Snap controls
// ─────────────────────────────────────────────────────────────────────────────
snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Layer addition controls (boundary layer)
// ─────────────────────────────────────────────────────────────────────────────
addLayersControls
{
    relativeSizes       true;
    expansionRatio      1.3;
    finalLayerThickness 0.6;
    minThickness        0.1;

    layers
    {
        geometry
        {
            nSurfaceLayers  5;
        }
        ground
        {
            nSurfaceLayers  3;
        }
    }

    nGrow                   0;
    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

// ─────────────────────────────────────────────────────────────────────────────
// Mesh quality controls
// ─────────────────────────────────────────────────────────────────────────────
meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minFlatness             0.5;
    minVol                  1e-13;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.05;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;
}

writeFlags
(
    scalarLevels
);

mergeTolerance 1e-6;

// ************************************************************************* //
