simulations/openfoam/templates/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: v2312
    \\  /    A nd           | Web:     www.OpenFOAM.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// __WIND_VELOCITY__ will be replaced by the CFD runner, e.g. (20 0 0)
#include        "initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    // ── Inlet ──────────────────────────────────────────────────────────────
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    // ── Outlet ─────────────────────────────────────────────────────────────
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    // ── Ground (no-slip) ───────────────────────────────────────────────────
    ground
    {
        type            noSlip;
    }

    // ── Top / Sides (symmetry) ──────────────────────────────────────────────
    top
    {
        type            symmetry;
    }

    sides
    {
        type            symmetry;
    }

    // ── Object surface (no-slip wall) ──────────────────────────────────────
    geometry
    {
        type            noSlip;
    }

    // ── Frontal / back symmetry planes (blockMesh fallback) ────────────────
    frontAndBack
    {
        type            symmetry;
    }
}

// ************************************************************************* //
