simulations/openfoam/templates/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: v2312
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // ── Pressure ────────────────────────────────────────────────────────────
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    // ── Velocity & turbulence fields ─────────────────────────────────────────
    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|k|omega|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// SIMPLE algorithm settings
// ─────────────────────────────────────────────────────────────────────────────

SIMPLE
{
    nNonOrthogonalCorrectors    2;
    consistent                  yes;    // SIMPLEC variant – better convergence

    residualControl
    {
        p               1e-4;
        U               1e-5;
        k               1e-5;
        omega           1e-5;
        epsilon         1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
        epsilon         0.7;
        nut             0.9;
    }
}

// ************************************************************************* //
